import time

# 全てのエラーメッセージを集約した辞書
ERROR_MESSAGES = {
    'date_parse_error' : '日付のパースに失敗しました。\n RSSフィードの日付のフォーマットが正しくない場合に発生します。\n もしくは、フィードのパースに失敗した場合に発生します。',
    'entry_not_found_error' : '指定されたURLのフィードにエントリがありません。',
    'feed_title_duplicate_error' : 'フィードのタイトルが重複しています。',
    'date_format_error' : 'フィードの日付のフォーマットが正しくありません。',
    'not_found_error' : '指定されたURLのフィードが見つかりませんでした。',
    'not_exists_error' : 'フィードが登録されていない為、削除できません。',
    'feed_url_duplicate_error' : 'フィードのURLが重複しています。',
    'already_exists_error' : '既に登録されているフィードです。',
    'invalid_value_error' : '不正な値が入力されました。',
    'url_required_error' : 'フィードのURLは必須です。',
    'parse_error' : 'フィードのパースに失敗しました。',
    'url_error' : 'フィードのURLが正しくありません。',
}

# 日付のフォーマット
DATE_FORMAT = {
    r'^\d{4}-\d{2}-\d{2}T\d{2}:\d{2}:\d{2}(\.\d+)?[+-]\d{2}:\d{2}:\d{2}$', 
    r'^\d{4}/\d{2}/\d{2}T\d{2}:\d{2}:\d{2}(\.\d+)?[+-]\d{2}:\d{2}:\d{2}$', 
    r'^\d{4}-\d{2}-\d{2} \d{2}:\d{2}:\d{2}(\.\d+)?[+-]\d{2}:\d{2}:\d{2}$', 
    r'^\d{4}/\d{2}/\d{2} \d{2}:\d{2}:\d{2}(\.\d+)?[+-]\d{2}:\d{2}:\d{2}$',
    r'^\d{4}-\d{2}-\d{2}T\d{2}:\d{2}:\d{2}(\.\d+)?[+-]\d{2}:\d{2}$',
    r'^\d{4}/\d{2}/\d{2}T\d{2}:\d{2}:\d{2}(\.\d+)?[+-]\d{2}:\d{2}$',
    r'^\d{4}/\d{2}/\d{2} \d{2}:\d{2}:\d{2}(\.\d+)?[+-]\d{2}:\d{2}$',
    r'^\d{4}-\d{2}-\d{2} \d{2}:\d{2}:\d{2}(\.\d+)?[+-]\d{2}:\d{2}$',
    r'^\d{4}-\d{2}-\d{2}T\d{2}:\d{2}:\d{2}(\.\d+)?[+-]\d{2}$',
    r'^\d{4}/\d{2}/\d{2}T\d{2}:\d{2}:\d{2}(\.\d+)?[+-]\d{2}$',
    r'^\d{4}-\d{2}-\d{2} \d{2}:\d{2}:\d{2}(\.\d+)?[+-]\d{2}$',
    r'^\d{4}/\d{2}/\d{2} \d{2}:\d{2}:\d{2}(\.\d+)?[+-]\d{2}$',
    r'^\d{4}-\d{2}-\d{2}T\d{2}:\d{2}:\d{2}(\.\d+)?$',
    r'^\d{4}/\d{2}/\d{2}T\d{2}:\d{2}:\d{2}(\.\d+)?$',
    r'^\d{4}-\d{2}-\d{2} \d{2}:\d{2}:\d{2}(\.\d+)?$',
    r'^\d{4}/\d{2}/\d{2} \d{2}:\d{2}:\d{2}(\.\d+)?$',
    r'^\d{4}/\d{2}/\d{2}T\d{2}:\d{2}:\d{2}$',
    r'^\d{4}-\d{2}-\d{2}T\d{2}:\d{2}:\d{2}$',
    r'^\d{4}-\d{2}-\d{2} \d{2}:\d{2}:\d{2}$',
    r'^\d{4}/\d{2}/\d{2} \d{2}:\d{2}:\d{2}$',
    r'^\d{4}-\d{2}-\d{2}T\d{2}:\d{2}$',
    r'^\d{4}/\d{2}/\d{2}T\d{2}:\d{2}$',
    r'^\d{4}-\d{2}-\d{2} \d{2}:\d{2}$',
    r'^\d{4}/\d{2}/\d{2} \d{2}:\d{2}$',
    r'^\d{4}-\d{2}-\d{2}$',
    r'^\d{4}/\d{2}/\d{2}$',
    r'^\d{2}-\d{2}-\d{4}$',
    r'^\d{2}/\d{2}/\d{4}$',
}

# Zsetにフィードを追加または更新
def schedule_feed(redis_conn, feed_id, interval=300):
    next_update = time.time() + interval
    redis_conn.zadd('feeds', {feed_id: next_update})

# 更新が必要なフィードを取得
def get_feeds_to_update(redis_conn):
    now = time.time()
    return redis_conn.zrangebyscore('feeds', 0, now)
